# Входные данные
team1_num = 5
team2_num = 6
score_1 = 40
score_2 = 42
team1_time = 1552.512
team2_time = 2153.31451
tasks_total = 82
time_avg = 45.2
challenge_result = 'Победа команды Волшебники данных!'

# Использование форматирования строк методом % для одного параметра
print('В команде %s' % 'Мастера кода участников: ', team1_num, '!', sep='')

# Использование форматирования строк методом % для нескольких параметров
print('Итого сегодня в командах участников: %d и %d !' % (team1_num, team2_num))

# Использование форматирования методом format() для одного параметра
print('Команда Волшебники данных решила задач: {} !'.format(score_2))

# Использование форматирования методом format() для нескольких параметров
print('{} решили задачи за {}с'.format('Волшебники данных', round(team2_time, 1)))

# Использование форматирования методом f-строки
print(f'Команды решили {score_1} и {score_2} задач.')

# Расчитаем победителя
if score_1 > score_2 or score_1 == score_2 and team1_time > team2_time:
  result = 'Победа команды Мастера кода!'
elif score_1 < score_2 or score_1 == score_2 and team1_time < team2_time:
  result = 'Победа команды Волшебники Данных!'
else:
  result = 'Ничья!'

# Выедем результат форматированный методом f-строк
print(f'Результат: {result}')

# Итоговый вывод
print(f'Сегодня было решено {tasks_total} задач, в среднем по {time_avg} секунды на задачу!')